app/Controllers/peminjaman.php

SELECT `peminjaman`.*, `anggota`.`username` as `nama_anggota`, `petugas`.`username` as `nama_petugas`, GROUP_CONCAT(buku.cover) as cover, GROUP_CONCAT(buku.judul SEPARATOR "<br>") as judul_buku
FROM `peminjaman`
LEFT JOIN `users` as `anggota` ON `anggota`.`id` = `peminjaman`.`id_anggota`
LEFT JOIN `users` as `petugas` ON `petugas`.`id` = `peminjaman`.`id_petugas`
LEFT JOIN `detail_peminjaman` ON `detail_peminjaman`.`id_peminjaman` = `peminjaman`.`id_peminjaman`
LEFT JOIN `buku` ON `buku`.`id_buku` = `detail_peminjaman`.`id_buku`
LEFT JOIN `pengembalian` ON `pengembalian`.`id_peminjaman` = `peminjaman`.`id_peminjaman`
GROUP BY `peminjaman`.`id_peminjaman`
ORDER BY `peminjaman`.`id_peminjaman` DESC
---
    public function index()
    {
        $builder = $this->db->table('peminjaman');

        $builder->select('
            peminjaman.*,
            anggota.username as nama_anggota,
            petugas.username as nama_petugas,
            GROUP_CONCAT(buku.cover) as cover,
            GROUP_CONCAT(buku.judul SEPARATOR "<br>") as judul_buku
        ');

        $builder->join('users as anggota', 'anggota.id = peminjaman.id_anggota', 'left');
        $builder->join('users as petugas', 'petugas.id = peminjaman.id_petugas', 'left');
        $builder->join('detail_peminjaman', 'detail_peminjaman.id_peminjaman = peminjaman.id_peminjaman', 'left');
        $builder->join('buku', 'buku.id_buku = detail_peminjaman.id_buku', 'left');
        $builder->join('pengembalian', 'pengembalian.id_peminjaman = peminjaman.id_peminjaman', 'left');

        $builder->groupBy('peminjaman.id_peminjaman');
        $builder->orderBy('peminjaman.id_peminjaman', 'DESC');

        $data['peminjaman'] = $builder->get()->getResultArray();

SELECT *
FROM `users`
WHERE `role` = 'anggota'
SELECT *
FROM `buku`
---
   public function create()
{
    $data['anggota'] = $this->db->table('users')
        ->where('role', 'anggota')
        ->get()
        ->getResultArray();

    $data['buku'] = $this->db->table('buku')
        ->get()
        ->getResultArray();