app/Controllers/peminjaman.php

SELECT `peminjaman`.*, `anggota`.`username` as `nama_anggota`, `petugas`.`username` as `nama_petugas`, GROUP_CONCAT(buku.cover) as cover, GROUP_CONCAT(buku.judul SEPARATOR "<br>") as judul_buku
FROM `peminjaman`
LEFT JOIN `users` as `anggota` ON `anggota`.`id` = `peminjaman`.`id_anggota`
LEFT JOIN `users` as `petugas` ON `petugas`.`id` = `peminjaman`.`id_petugas`
LEFT JOIN `detail_peminjaman` ON `detail_peminjaman`.`id_peminjaman` = `peminjaman`.`id_peminjaman`
LEFT JOIN `buku` ON `buku`.`id_buku` = `detail_peminjaman`.`id_buku`
GROUP BY `peminjaman`.`id_peminjaman`
ORDER BY `peminjaman`.`id_peminjaman` DESC
---
    public function index()
    {
        $builder = $this->db->table('peminjaman');

        $builder->select('
            peminjaman.*,
            anggota.username as nama_anggota,
            petugas.username as nama_petugas,
            GROUP_CONCAT(buku.cover) as cover,
            GROUP_CONCAT(buku.judul SEPARATOR "<br>") as judul_buku
        ');

        $builder->join('users as anggota', 'anggota.id = peminjaman.id_anggota', 'left');
        $builder->join('users as petugas', 'petugas.id = peminjaman.id_petugas', 'left');
        $builder->join('detail_peminjaman', 'detail_peminjaman.id_peminjaman = peminjaman.id_peminjaman', 'left');
        $builder->join('buku', 'buku.id_buku = detail_peminjaman.id_buku', 'left');

        $builder->groupBy('peminjaman.id_peminjaman');
        $builder->orderBy('peminjaman.id_peminjaman', 'DESC');

        $data['peminjaman'] = $builder->get()->getResultArray();

INSERT INTO `peminjaman` (`id_anggota`, `tanggal_pinjam`, `status`) VALUES ('15', '2026-04-28', 'dipinjam')
---
    public function store()
    {
        $id_anggota = $this->request->getPost('id_anggota');
        $id_petugas = session()->get('id_user');
        $id_buku = $this->request->getPost('id_buku');
        $tanggal_pinjam = $this->request->getPost('tanggal_pinjam');

        if (!$id_petugas) {
            return redirect()->back()->with('error', 'Petugas belum login');
        }

        if (empty($id_buku)) {
            return redirect()->back()->with('error', 'Pilih minimal 1 buku');
        }

        if (!is_array($id_buku)) {
            $id_buku = [$id_buku];
        }
            $id_peminjaman = $this->db->table('peminjaman')->insert([
            'id_anggota' => $id_anggota,
            'id_petugas' => $id_petugas,
            'tanggal_pinjam' => $tanggal_pinjam,
            'tanggal_kembali' => date('Y-m-d', strtotime($tanggal_pinjam . ' +7 days')),
            'status' => 'dipinjam'
        ]);

        $id_peminjaman = $this->db->insertID();

SELECT `peminjaman`.*, `anggota`.`username` as `nama_anggota`, `petugas`.`username` as `nama_petugas`
FROM `peminjaman`
LEFT JOIN `users` as `anggota` ON `anggota`.`id` = `peminjaman`.`id_anggota`
LEFT JOIN `users` as `petugas` ON `petugas`.`id` = `peminjaman`.`id_petugas`
WHERE `peminjaman`.`id_peminjaman` = '92'
SELECT `detail_peminjaman`.*, `buku`.`judul`, `buku`.`cover`
FROM `detail_peminjaman`
LEFT JOIN `buku` ON `buku`.`id_buku` = `detail_peminjaman`.`id_buku`
WHERE `detail_peminjaman`.`id_peminjaman` = '92'
---
    public function detail($id)
    {
        $data['peminjaman'] = $this->db->table('peminjaman')
            ->select('peminjaman.*,
                      anggota.username as nama_anggota,
                      petugas.username as nama_petugas')
            ->join('users as anggota', 'anggota.id = peminjaman.id_anggota', 'left')
            ->join('users as petugas', 'petugas.id = peminjaman.id_petugas', 'left')
            ->where('peminjaman.id_peminjaman', $id)
            ->get()
            ->getRowArray();

        $data['detail'] = $this->db->table('detail_peminjaman')
            ->select('detail_peminjaman.*, buku.judul, buku.cover')
            ->join('buku', 'buku.id_buku = detail_peminjaman.id_buku', 'left')
            ->where('detail_peminjaman.id_peminjaman', $id)
            ->get()
            ->getResultArray();

SELECT *
FROM `peminjaman`
WHERE `id_peminjaman` = '92'
SELECT *
FROM `users`
WHERE `role` = 'anggota'
SELECT *
FROM `buku`
SELECT *
FROM `detail_peminjaman`
WHERE `id_peminjaman` = '92'
---
    public function edit($id)
{
    $data['peminjaman'] = $this->db->table('peminjaman')
        ->where('id_peminjaman', $id)
        ->get()
        ->getRowArray();

    $data['anggota'] = $this->db->table('users')
        ->where('role', 'anggota')
        ->get()
        ->getResultArray();

    $data['buku'] = $this->db->table('buku')
        ->get()
        ->getResultArray();

    $data['dipilih'] = $this->db->table('detail_peminjaman')
        ->where('id_peminjaman', $id)
        ->get()
        ->getResultArray();