app/Controllers/Pengembalian.php

SELECT *
FROM `pengembalian`
---
   public function index()
{
    $data['pengembalian'] = $this->db->table('pengembalian')
        ->get()
        ->getResultArray();

SELECT *
FROM `peminjaman`
---
  public function create()
{
    $data['peminjaman'] = $this->db->table('peminjaman')
        ->get()
        ->getResultArray();