app/Controllers/Penulis.php

SELECT *
FROM `penulis`
---
    public function index()
    {
        $model = new PenulisModel();
        $data['penulis'] = $model->findAll();