app/Controllers/Rak.php

INSERT INTO `rak` (`nama_rak`, `lokasi`) VALUES ('Rak A1', 'bandung')
---
    public function store()
    {
        $this->rakModel->save([
            'nama_rak' => $this->request->getPost('nama_rak'),
            'lokasi'   => $this->request->getPost('lokasi'),
        ]);