app/Controllers/ulasan.php

    public function index()
    {
        $data['ulasan'] = $this->db->table('ulasan u')
            ->select('u.*, b.judul, a.nama_anggota')
            ->join('buku b', 'b.id_buku = u.id_buku')
            ->join('anggota a', 'a.id_anggota = u.id_anggota')
            ->get()
            ->getResultArray();
---
SELECT `u`.*, `b`.`judul`, `a`.`nama_anggota`
FROM `ulasan` `u`
JOIN `buku` `b` ON `b`.`id_buku` = `u`.`id_buku`
JOIN `anggota` `a` ON `a`.`id_anggota` = `u`.`id_anggota`

    public function create()
    {
        $data['buku'] = $this->db->table('buku')->get()->getResultArray();
        $data['anggota'] = $this->db->table('anggota')->get()->getResultArray();
---
SELECT *
FROM `buku`
SELECT *
FROM `anggota`

    public function store()
    {
        $this->db->table('ulasan')->insert([
            'id_buku'    => $this->request->getPost('id_buku'),
            'id_anggota' => $this->request->getPost('id_anggota'),
            'rating'     => $this->request->getPost('rating'),
            'komentar'   => $this->request->getPost('komentar'),
            'tanggal'    => $this->request->getPost('tanggal'),
        ]);
---
INSERT INTO `ulasan` (`id_buku`, `id_anggota`, `rating`, `komentar`, `tanggal`) VALUES ('13', '2', '2', 'dsfwetete', '2026-04-08')

    public function edit($id)
    {
        $data['ulasan'] = $this->db->table('ulasan')
            ->where('id_ulasan', $id)
            ->get()
            ->getRowArray();

        $data['buku'] = $this->db->table('buku')->get()->getResultArray();
        $data['anggota'] = $this->db->table('anggota')->get()->getResultArray();
---
SELECT *
FROM `ulasan`
WHERE `id_ulasan` = '3'
SELECT *
FROM `buku`
SELECT *
FROM `anggota`