app/Controllers/Users.php

SELECT `users`.*, COUNT(peminjaman.id_peminjaman) as total_pinjam
FROM `users`
LEFT JOIN `peminjaman` ON `peminjaman`.`id_anggota` = `users`.`id`
GROUP BY `users`.`id`
---
    public function index()
    {
        $builder = $this->db->table('users');

        $builder->select('
            users.*,
            COUNT(peminjaman.id_peminjaman) as total_pinjam
        ');

        $builder->join(
            'peminjaman',
            'peminjaman.id_anggota = users.id',
            'left'
        );

        $builder->groupBy('users.id');

        $data['users'] = $builder->get()->getResultArray();

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
---
    public function edit($id)
    {
        $data['user'] = $this->users->find($id);

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
---
    public function detail($id)
    {
        $data['user'] = $this->users->find($id);

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
---
    public function wa($id)
    {
        $user = $this->users->find($id);